In [1]:
import pandas as pd
days = pd.Series(['Monday', 'Tuesday', 'Thursday'])
print(days)

0      Monday
1     Tuesday
2    Thursday
dtype: object

In [2]:
import numpy as np
days_list = np.array(['Monday', 'Tuesday', 'Thursday'])
numpy_days =pd.Series(days_list)
print(numpy_days)

0      Monday
1     Tuesday
2    Thursday
dtype: object

In [3]:
import pandas as pd
days = pd.Series(['Monday', 'Tuesday', 'Thursday'], index = ['a', 'b', 'c'])
print(days)

a      Monday
b     Tuesday
c    Thursday
dtype: object

In [4]:
days1 = pd.Series({'a': 'Monday', 'b': 'Tuesday', 'c': 'Thursday'})
print(days1)

a      Monday
b     Tuesday
c    Thursday
dtype: object

In [5]:
days[1:]

b     Tuesday
c    Thursday
dtype: object

In [6]:
days1['b']

'Tuesday'

In [7]:
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [10]:
df_dict = {'Country': ['Nigeria', 'Ghana', 'United Kingdom', 'France'], 
           'Capital': ['Abuja', 'Accra', 'London', 'Paris'], 
           'Population': [10000, 8500, 11000, 12000 ],
           'Age': [65, 70, 72, 75]}

df = pd.DataFrame(df_dict, index = [1,2,3,4])
df

          Country Capital  Population  Age
1         Nigeria   Abuja       10000   65
2           Ghana   Accra        8500   70
3  United Kingdom  London       11000   72
4          France   Paris       12000   75

In [16]:
df_list = [['Nigeria', 'Abuja', 10000, 65],
           ['Ghana', 'Accra', 8500, 70],
           ['United Kingdom', 'London', 11000, 72],
           ['France', 'Paris', 12000, 75]]
df1 = pd.DataFrame(df_list, columns = ['Country' ,'Capital', 'Population', 'Age'], index = [1,2,3,4])
df1

          Country Capital  Population  Age
1         Nigeria   Abuja       10000   65
2           Ghana   Accra        8500   70
3  United Kingdom  London       11000   72
4          France   Paris       12000   75

In [17]:
#select the row in index 3
df.iloc[3]

Country       France
Capital        Paris
Population     12000
Age               75
Name: 4, dtype: object

In [18]:
#select the row with label 2
df.loc[2]

Country       Ghana
Capital       Accra
Population     8500
Age              70
Name: 2, dtype: object

In [20]:
df['Country']

1           Nigeria
2             Ghana
3    United Kingdom
4            France
Name: Country, dtype: object

In [21]:
df.at[2, 'Country']

'Ghana'

In [22]:
df.iat[0,2]

10000

In [24]:
df['Population'].sum()

41500

In [25]:
df.mean()

Population    10375.0
Age              70.5
dtype: float64

In [26]:
df.describe()

         Population        Age
count      4.000000   4.000000
mean   10375.000000  70.500000
std     1493.039406   4.203173
min     8500.000000  65.000000
25%     9625.000000  68.750000
50%    10500.000000  71.000000
75%    11250.000000  72.750000
max    12000.000000  75.000000

In [29]:
df_dict2 = {'Name': ['James', 'John', 'Tyler', np.nan], 
            'Profession': ['Doctor', 'Writer', 'Journalist', 'Engineer'],
            'Experience': [12, np.nan, 10, 8],
            'Height': [np.nan, 175, 165, 180]}
new_df = pd.DataFrame(df_dict2)
new_df

    Name  Profession  Experience  Height
0  James      Doctor        12.0     NaN
1   John      Writer         NaN   175.0
2  Tyler  Journalist        10.0   165.0
3    NaN    Engineer         8.0   180.0

In [31]:
#checks for cells with missing values as true
new_df.isnull()

    Name  Profession  Experience  Height
0  False       False       False    True
1  False       False        True   False
2  False       False       False   False
3   True       False       False   False

In [32]:
#removes rows with missing values
new_df.dropna()

    Name  Profession  Experience  Height
2  Tyler  Journalist        10.0   165.0